micropython/micropython/ports/esp32/boards/LOLIN_S3_PRO/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "LOLIN_S3_PRO"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "LolinS3Pro"

#define MICROPY_HW_I2C0_SCL                 (10)
#define MICROPY_HW_I2C0_SDA                 (9)

#define MICROPY_HW_SPI1_MOSI                (11)
#define MICROPY_HW_SPI1_MISO                (13)
#define MICROPY_HW_SPI1_SCK                 (12)
